Catalogs/бит_ИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ИсточникиДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновщика</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСуммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательныйПараметрСО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_СтатьиОборотов_НазначенияЦелевыхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатьиОборотов_НазначенияЦелевыхСредств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СтатьиОборотов_НоменклатурныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатьиОборотов_НоменклатурныеГруппы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СтатьиОборотов_СтатьиЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатьиОборотов_СтатьиЗатрат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ИсточникиДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		
		Объект.НаименованиеПолное = Объект.Наименование;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	ПриИзмененииСчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Объект.Счет Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ЗначениеЗаполнено(Объект.Счет) Тогда
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСуммыПриИзменении(Элемент)
	
	Если Элементы.ПолеСуммы.СписокВыбора.НайтиПоЗначению(Объект.ПолеСуммы) = Неопределено Тогда
		
		Объект.ПолеСуммы = "";

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Неверно указанно поле суммы");
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_ЗакрытыйСлужебныйСервер.ПроверитьВозможностьРаботы(Отказ, Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если ЗначениеЗаполнено(Объект.Счет) Тогда
		
		ИнициализироватьНастройкиКомпановщика(Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтркутураНастроек = Новый Структура("КомпоновщикНастроек", КомпоновщикНастроек.ПолучитьНастройки());
	ТекущийОбъект.СохранитьНастройки(СтркутураНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	ПоляОтчета = Новый Структура("Счет,
	|Период,
	|Регистратор,
	|Субконто1,
	|Субконто2,
	|Субконто3,
	|КорСчет,
	|КорСубконто1,
	|КорСубконто2,
	|КорСубконто3,
	|Подразделение,
	|ПодразделениеКор,
	|Валюта,
	|ВалютаКор,
	|СуммаОборот,
	|СуммаОборотДт,
	|СуммаОборотКт");
	
	КэшированныеЗначения.Вставить("ПоляОтчета", ПоляОтчета);
	
	РесурсыОтчета = Новый Структура("СуммаОборот,
	|СуммаОборотДт,
	|СуммаОборотКт");
	
	КэшированныеЗначения.Вставить("РесурсыОтчета", РесурсыОтчета);
	
	ОбязательныеПоля = Новый Массив();
	ОбязательныеПоля.Добавить("СтатьяОборотов");
	ОбязательныеПоля.Добавить("Счет");
	ОбязательныеПоля.Добавить("Период");
	ОбязательныеПоля.Добавить("Регистратор");
	ОбязательныеПоля.Добавить("Субконто1");
	ОбязательныеПоля.Добавить("Субконто2");
	ОбязательныеПоля.Добавить("Субконто3");
	ОбязательныеПоля.Добавить("Подразделение");
	ОбязательныеПоля.Добавить("СуммаОборот");
	ОбязательныеПоля.Добавить("СуммаОборотДт");
	ОбязательныеПоля.Добавить("СуммаОборотКт");
	
	КэшированныеЗначения.Вставить("ОбязательныеПоля", ОбязательныеПоля);
	
	ПоляОграниченияУсловия = Новый Массив();
	ПоляОграниченияУсловия.Добавить("Счет");
	ПоляОграниченияУсловия.Добавить("Валюта");
	ПоляОграниченияУсловия.Добавить("ВалютаКор");
	ПоляОграниченияУсловия.Добавить("Организация");
	ПоляОграниченияУсловия.Добавить("СуммаОборот");
	ПоляОграниченияУсловия.Добавить("СуммаОборотКТ");
	ПоляОграниченияУсловия.Добавить("СуммаОборотДт");
	
	КэшированныеЗначения.Вставить("ПоляОграниченияУсловия", ПоляОграниченияУсловия);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Функция СформироватьТекстЗапроса()
	
	СтрокаСубконтоСЗ  = Объект.Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат            , "ВидСубконто");
	СтрокаСубконтоНГ  = Объект.Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы    , "ВидСубконто");
	СтрокаСубконтоНЦС = Объект.Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств, "ВидСубконто");
	
	НомерСубкното = "";
	Источник      = "";
	
	Если СтрокаСубконтоСЗ = Неопределено  тогда
		
		Если СтрокаСубконтоНГ = Неопределено  Тогда 
			
			Если НЕ СтрокаСубконтоНЦС = Неопределено Тогда 
				
				Источник      = "РегистрСведений.бит_СтатьиОборотов_НазначенияЦелевыхСредств";
				НомерСубкното = СтрокаСубконтоНЦС.НомерСтроки;
				
			КонецЕсли;
			
		Иначе
			
			Источник      = "РегистрСведений.бит_СтатьиОборотов_НоменклатурныеГруппы";
			НомерСубкното = СтрокаСубконтоНГ.НомерСтроки;
			
		КонецЕсли;
		
	Иначе
		
		Источник      = "РегистрСведений.бит_СтатьиОборотов_СтатьиЗатрат";
		НомерСубкното = СтрокаСубконтоСЗ.НомерСтроки;
		
	КонецЕсли;
	
	Если Источник = "" Тогда
		
		Объект.ОбязательныйПараметрСО = Истина;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйОбороты.ПериодМесяц КАК Период,
		|	ХозрасчетныйОбороты.Регистратор,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	ХозрасчетныйОбороты.КорСчет,
		|	ХозрасчетныйОбороты.КорСубконто1,
		|	ХозрасчетныйОбороты.КорСубконто2,
		|	ХозрасчетныйОбороты.КорСубконто3,
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Валюта,
		|	ХозрасчетныйОбороты.ВалютаКор,
		|	ХозрасчетныйОбороты.Подразделение,
		|	ХозрасчетныйОбороты.ПодразделениеКор,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
		|	МАКСИМУМ(&СтатьяОборотов) КАК СтатьяОборотов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНачало {(&ГраницаНачало)}, &ГраницаКонец {(&ГраницаКонец)}, Авто, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.ПериодМесяц,
		|	ХозрасчетныйОбороты.Регистратор,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	ХозрасчетныйОбороты.КорСчет,
		|	ХозрасчетныйОбороты.КорСубконто1,
		|	ХозрасчетныйОбороты.КорСубконто2,
		|	ХозрасчетныйОбороты.КорСубконто3,
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Валюта,
		|	ХозрасчетныйОбороты.ВалютаКор,
		|	ХозрасчетныйОбороты.Подразделение,
		|	ХозрасчетныйОбороты.ПодразделениеКор";
		
	Иначе
		
		Объект.ОбязательныйПараметрСО = Ложь;
		
		ТекстЗапроса =
		"ВЫБРАТЬ 
		|	Соответствия.СтатьяОборотов,
		|	Соответствия.ЗначениеСоответствия
		|ПОМЕСТИТЬ ТаблицаСоответствий
		|ИЗ
		|	" + Источник + " КАК Соответствия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйОбороты.ПериодМесяц КАК Период,
		|	ХозрасчетныйОбороты.Регистратор,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	ХозрасчетныйОбороты.КорСчет,
		|	ХозрасчетныйОбороты.КорСубконто1,
		|	ХозрасчетныйОбороты.КорСубконто2,
		|	ХозрасчетныйОбороты.КорСубконто3,
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Валюта,
		|	ХозрасчетныйОбороты.ВалютаКор,
		|	ХозрасчетныйОбороты.Подразделение,
		|	ХозрасчетныйОбороты.ПодразделениеКор,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
		|	ТаблицаСоответствий.СтатьяОборотов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНачало {(&ГраницаНачало)}, &ГраницаКонец {(&ГраницаКонец)}, Авто, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСоответствий КАК ТаблицаСоответствий
		|		ПО ХозрасчетныйОбороты.Субконто" + НомерСубкното + " = ТаблицаСоответствий.ЗначениеСоответствия
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.ПериодМесяц,
		|	ХозрасчетныйОбороты.Регистратор,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	ХозрасчетныйОбороты.КорСчет,
		|	ХозрасчетныйОбороты.КорСубконто1,
		|	ХозрасчетныйОбороты.КорСубконто2,
		|	ХозрасчетныйОбороты.КорСубконто3,
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Валюта,
		|	ХозрасчетныйОбороты.ВалютаКор,
		|	ХозрасчетныйОбороты.Подразделение,
		|	ХозрасчетныйОбороты.ПодразделениеКор,
		|	ТаблицаСоответствий.СтатьяОборотов"
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция СоздатьСКД(ТекстЗапроса)
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	// создадим набор данных
	ИД  = СКД.ИсточникиДанных.Добавить();
	ИД.Имя                = "ОборотыПоСчету";
	ИД.ТипИсточникаДанных = "Local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Обороты";
	НаборДанных.ИсточникДанных = ИД.Имя;
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	НаборДанных.Поля.Очистить();
	СКД.ПоляИтога.Очистить();
	
	Для каждого Поле Из мКэшЗначений.ПоляОтчета Цикл
		
		ИмяПоля = Поле.Ключ;
		
		ОграничениеИспользования = НЕ мКэшЗначений.ПоляОграниченияУсловия.Найти(ИмяПоля) = Неопределено;
		
		ПолеКомпановки = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеКомпановки.ПутьКДанным = ИмяПоля;
		ПолеКомпановки.Поле        = ИмяПоля;
		ПолеКомпановки.ОграничениеИспользования.Условие           = ОграничениеИспользования;
		ПолеКомпановки.ОграничениеИспользованияРеквизитов.Условие = ОграничениеИспользования;
		
	КонецЦикла;
	
	ВидыСубконтоСчета = ПолучитьВидыСубконто(Объект.Счет);
	
	Для каждого Субконто Из ВидыСубконтоСчета Цикл
		
		ИмяПоля = "Субконто" + Субконто.НомерСтроки;
		
		ПолеКомпановки = НаборДанных.Поля.Найти(ИмяПоля);
		
		Если НЕ ПолеКомпановки = Неопределено Тогда
			
			ПолеКомпановки.Заголовок   = Субконто.Наименование;
			ПолеКомпановки.ТипЗначения = Субконто.ТипЗначения;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Для каждого Поле Из мКэшЗначений.РесурсыОтчета Цикл
		
		ИмяРесурса = Поле.Ключ;
		
		ПолеРесурса = СКД.ПоляИтога.Добавить();
		ПолеРесурса.Выражение   = "Сумма("+ИмяРесурса+")";
		ПолеРесурса.ПутьКДанным = ИмяРесурса;
		
	КонецЦикла; 
	
	Параметр = СКД.Параметры.Добавить();
	Параметр.Имя                      = "ГраницаНачало";
	Параметр.Заголовок                = "ГраницаНачало";
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр = СКД.Параметры.Добавить();
	Параметр.Имя                      = "ГраницаКонец";
	Параметр.Заголовок                = "ГраницаКонец";
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр = СКД.Параметры.Добавить();
	Параметр.Имя                      = "Счет";
	Параметр.Заголовок                = "Счет";
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр = СКД.Параметры.Добавить();
	Параметр.Имя                      = "Организация";
	Параметр.Заголовок                = "Организация";
	Параметр.ОграничениеИспользования = Истина;
	
	Если Объект.ОбязательныйПараметрСО Тогда
		
		Параметр = СКД.Параметры.Добавить();
		Параметр.Имя           = "СтатьяОборотов";
		Параметр.Заголовок     = "СтатьяОборотов";
		Параметр.ТипЗначения   = Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов");
		Параметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		Параметр.Значение      = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
		
		Параметр.ВключатьВДоступныеПоля = Истина;
		
	КонецЕсли; 
	
	Возврат СКД;
	
КонецФункции // ()

&НаСервере
Процедура ИнициализироватьНастройкиКомпановщика(ВостановитьНастройки = Ложь)
	
	СхемаКомпоновкиДанных = СоздатьСКД(Объект.Запрос);
	
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	// Выбранные поля компоновщика настроек.
	
	ГруппаПолей = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаПолей.Заголовок = "Обязательные поля";
	
	Для Каждого ОбязательноеПоле Из мКэшЗначений.ОбязательныеПоля Цикл
		
		ПолеСКД = НайтиПолеСКДПоПолномуИмени(КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы, ОбязательноеПоле);
		
		Если ПолеСКД <> Неопределено Тогда
			ВыбранноеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ПолеСКД.Поле;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВостановитьНастройки Тогда
		
		ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ИсточникиДанных"));
		
		СохраненыеНастройки = ТекОбъект.ПолучитьНастройки();
		
		Если НЕ СохраненыеНастройки.КомпоновщикНастроек = Неопределено Тогда
			
			КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Отбор, СохраненыеНастройки.КомпоновщикНастроек.Отбор);
			КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
			бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Выбор, СохраненыеНастройки.КомпоновщикНастроек.Выбор);
			
			Для каждого Элемент Из СохраненыеНастройки.КомпоновщикНастроек.ПараметрыДанных.Элементы Цикл
				
				КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Элемент.Параметр, Элемент.Значение); 
				
			КонецЦикла;
			
			Если СохраненыеНастройки.КомпоновщикНастроек.ПараметрыДанных.Элементы.Количество() = 0 И Объект.ОбязательныйПараметрСО Тогда
				
				КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтатьяОборотов", Справочники.бит_СтатьиОборотов.ПустаяСсылка());
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетаНаСервере()
	
	Объект.Запрос = СформироватьТекстЗапроса();
	ИнициализироватьНастройкиКомпановщика();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыСубконто(Счет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.Ссылка,
	|	ХозрасчетныйВидыСубконто.ВидСубконто,
	|	ВидыСубконтоХозрасчетные.Наименование,
	|	ВидыСубконтоХозрасчетные.ТипЗначения,
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВидыСубконтоХозрасчетные КАК ВидыСубконтоХозрасчетные
	|		ПО ХозрасчетныйВидыСубконто.ВидСубконто = ВидыСубконтоХозрасчетные.Ссылка
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Среди элементов полей СКД найти поле по имени.
//
&НаСервере
Функция НайтиПолеСКДПоИмени(Элементы, Имя)
	
	Для Каждого Элемент Из Элементы Цикл
		Если ВРЕГ(Строка(Элемент.Поле)) = ВРЕГ(Имя) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // НайтиПолеСКДПоИмени()

// Найти поле СКД по полному имени.
//
&НаСервере
Функция НайтиПолеСКДПоПолномуИмени(Элементы, ПолноеИмя)
	
	масЧастейИмен = ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя);
	колЧастей = масЧастейИмен.Количество();
	
	текИмя = масЧастейИмен[0];
	Поле = НайтиПолеСКДПоИмени(Элементы, текИмя);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Сч = 2 По колЧастей Цикл
		текИмя = текИмя +"." + масЧастейИмен[Сч-1];
		Поле = НайтиПолеСКДПоИмени(Поле.Элементы, текИмя);
		Если Поле = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Поле;
	
КонецФункции // НайтиПолеСКДПоПолномуИмени()

// Полное имя поля разделить по частям
//
&НаСервере
Функция ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя)
	
	масЧастей = Новый Массив;
	СтрИмя = ПолноеИмя;
	
	Пока Не ПустаяСтрока(СтрИмя) Цикл
		Если Лев(СтрИмя, 1) = "[" Тогда
			
			Поз = Найти(СтрИмя, "]");
			Если Поз = 0 Тогда
				масЧастей.Добавить(Сред(СтрИмя, 2));
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Сред(СтрИмя, 1, Поз));
				СтрИмя = Сред(СтрИмя, Поз + 2);
			КонецЕсли;
			
		Иначе
			
			Поз = Найти(СтрИмя, ".");
			Если Поз = 0 Тогда
				масЧастей.Добавить(СтрИмя);
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Лев(СтрИмя, Поз - 1));
				СтрИмя = Сред(СтрИмя, Поз + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат масЧастей;
	
КонецФункции // ИзПолногоИмениПоляПолучитьЧасти()

#КонецОбласти
